# SpotElevSingleOrUpperSuffix Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotElevSingleOrUpperSuffix Property
ParameterTypeId Class See Also
---
"Single/Upper Value Suffix"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotElevSingleOrUpperSuffix { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotElevSingleOrUpperSuffix As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotElevSingleOrUpperSuffix {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace